Белгипрозем_2017/src/InformationRegisters/мИмеютПравоПодписи/мИмеютПравоПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мИмеютПравоПодписи</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/мИмеютПравоПодписи/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("ВидДокумента", ВидДокумента);
	Если ЗначениеЗаполнено(Организация) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидДокумента) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ВидДокумента", ВидДокумента);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("Организация", Организация);
	
	УстановитьОтборСписка(Список, ПараметрыОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидДокументаПриИзменении(Элемент)
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("ВидДокумента", ВидДокумента);
	
	УстановитьОтборСписка(Список, ПараметрыОтбора);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	// вид документа 
	_ВидДокумента = ПараметрыОтбора.Получить("ВидДокумента");
	Если _ВидДокумента <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(_ВидДокумента) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"ВидДокумента");
		Иначе
			СписокВидов = Новый СписокЗначений;
			СписокВидов.Добавить(_ВидДокумента);
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"ВидДокумента",
				СписокВидов,
				ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
		КонецЕсли;
	КонецЕсли;
	
	// организация 
	_Организация = ПараметрыОтбора.Получить("Организация");
	Если _Организация <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(_Организация) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Организация");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Организация",
				_Организация);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюЗапись(Команда)
	ПараметрыФормы = Новый Структура("Организация, ВидДокумента", Организация, ВидДокумента);
	ОткрытьФорму("РегистрСведений.мИмеютПравоПодписи.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры
